
&НаСервере
Процедура КомандаПриИзмененииНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)  
	
	//МассивПараметровВыбора = Новый Массив;
	//МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Проведен",Ложь));
	//НовыеПараметрыВыбора =  Новый ФиксированныйМассив(МассивПараметровВыбора);
	//Элементы.Квиз.ПараметрыВыбора = НовыеПараметрыВыбора;   
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Капитан", ПользователиКлиент.ТекущийПользователь()));
	НовыеПараметрыВыбора =  Новый ФиксированныйМассив(МассивПараметровВыбора);
	Элементы.Команда.ПараметрыВыбора = НовыеПараметрыВыбора;

КонецПроцедуры

&НаСервере
Процедура КвизПриИзмененииНаСервере()
	
	Раунды.Параметры.УстановитьЗначениеПараметра("Квиз", Объект.Квиз);
	
КонецПроцедуры

&НаКлиенте
Процедура КвизПриИзменении(Элемент)
	
	КвизПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РаундыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Раунды.ТекущиеДанные;   
	Если ТекущиеДанные.Активность Тогда
		ЗаполнитьВопросы(ТекущиеДанные.Раунд);
		Объект.Раунд = ТекущиеДанные.Раунд;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВопросы(Раунд);
 Ответы.Загрузить(Раунд.Вопросы.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОтветы(Команда)
	ЗаписатьОтветыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОтветыНаСервере()
	
	СтрокаРаунда = Объект.Квиз.Раунды.Найти(Объект.Раунд); 
	Если СтрокаРаунда.Активность = Истина Тогда
		РегистрыСведений.РезультатыКвиза.ЗаписатьРезультатыРаунда(Объект.Квиз,Объект.Раунд,Ответы.Выгрузить());
	Иначе
		ВызватьИсключение("Раунд завершен. Ответы не принимаются");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветыОтветПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Ответы.ТекущиеДанные;
	ТекущиеДанные.Команда = Объект.Команда;
	ТекущиеДанные.Принят = ОтветВерный(ТекущиеДанные.Вопрос,ТекущиеДанные.Ответ);
КонецПроцедуры

Функция ОтветВерный(Вопрос,Ответ)
	Возврат Вопрос.ЭталонныйОтвет = Ответ;
КонецФункции








