
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр ТурнирнаяТаблица Приход
	Движения.ТурнирнаяТаблица.Записывать = Истина;
	Для Каждого ТекСтрокаТурнирнаяТаблица Из ТурнирнаяТаблица Цикл
		Движение = Движения.ТурнирнаяТаблица.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Команда = ТекСтрокаТурнирнаяТаблица.Команда;
		Движение.Раунд = ТекСтрокаТурнирнаяТаблица.Раунд;
		Движение.КоличествоБаллов = ТекСтрокаТурнирнаяТаблица.КоличествоБаллов;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ЗаполнитьРаунды() Экспорт 
	
	ЭтотОбъект.Раунды.Очистить();
	
	Для Каждого СтрокаРаунда из Игра.Раунды Цикл
		Раунд = ЭтотОбъект.Раунды.Добавить();
		Раунд.Раунд = СтрокаРаунда.Раунд;
	конецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если не ЭтоНовый() Тогда 
		ТурнирнаяТаблица.Очистить();
		РезультатыКвиза = РегистрыСведений.РезультатыКвиза.ПолучитьРезультатыКвиза(Ссылка);  
		
		Пока РезультатыКвиза.Следующий() Цикл
			
			ТекСтрокаРаунд = Раунды.Найти(РезультатыКвиза.Раунд);
			
			КоличествоБаллов = РезультатыКвиза.КоличествоБаллов;
			
			Если ТекСтрокаРаунд.СоСписаниемБаллов Тогда
				КоличествоБаллов = РезультатыКвиза.КоличествоБаллов - РезультатыКвиза.ОтрицательныеБаллы;
			КонецЕсли; 
			
			СтрокаТТ = ТурнирнаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТТ, РезультатыКвиза);
			СтрокаТТ.КоличествоБаллов = КоличествоБаллов;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
